return {
  {
    "folke/snacks.nvim",
    opts = {
      dashboard = {
        preset = {
          -- Definimos el header dentro del preset
          header = [[⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡞⡠⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣤⣿⡶⠀⠀⠀⠀⠀⡄⣠⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣾⣦⣧⡀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣾⣿⣿⠃⠀⠀⠀⢀⣼⣜⣡⠔⠁⣀⡀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⠀⠀⢠⣶⣿⣿⣿⣿⣿⣿⣷⣶⣖⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀
⠀⠀⠀⠀⢀⣴⣿⣿⣿⡿⣿⡏⡏⠀⠾⣿⠿⠿⠿⠛⠻⠿⢿⣿⣿⣿⣿⣉⠁⠀⠀⠀⣰⣿⣿⡻⣏⣿⣿⣆⠀⠀⠀
⠀⠀⠀⣴⣿⣿⣿⣿⣿⣗⣿⣗⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣽⣿⣿⣿⣇⠈⠀⠀⣰⣿⣿⣿⢹⣾⣿⣿⣿⣧⠀⠀
⠀⠀⣼⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣶⣤⣀⣀⣤⣤⣴⣾⣿⣿⣿⣿⣮⣷⣶⣿⣿⣿⣿⣿⢾⣿⣿⣿⡿⣿⣧⠀
⠀⣼⣿⣿⣿⣿⣿⣿⡿⣽⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣷⣿⣿⡆
⢸⣿⣿⣿⣿⣿⣿⣿⡇⣿⡟⠁⡿⠋⢀⣽⣿⣿⣿⣿⣿⡿⢿⠙⠃⠀⠻⠉⠉⠻⣿⡅⠀⠻⡿⢸⣿⣿⣿⣿⣿⠻⣷
⣼⣿⠿⢿⡏⢿⣿⣿⡇⡟⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⠋⠃⠁⠀⠀⠀⠀⠀⠀⠀⠈⠃⠀⠀⢁⣿⣿⣿⢿⣏⣿⡇⠈
⠟⠁⠀⢸⠇⢸⣿⣿⡇⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣡⣴⣾⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀⠀⣼⣿⣿⡿⢸⠛⣿⡇⠀
⠀⠀⠀⠈⠀⠈⣿⣿⣿⠀⠀⠀⠀⣿⣿⡏⣿⣿⣿⣿⠿⠋⠉⠉⠉⣻⣿⣿⡇⠀⠀⠀⠀⣴⣿⣿⣿⠃⠀⠀⠸⡇⠀
⠀⠀⠀⠀⠀⠀⠙⣿⣿⣆⠀⠀⠀⠘⣿⣿⣿⣿⣿⣷⣦⣤⣤⣤⣤⣿⣿⣿⠃⠀⠀⠀⣼⣿⣿⠟⠁⠀⠀⠀⠀⠇⠀
⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⡄⠀⠀⣼⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠁⠀⠀⠀⣼⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠀⠀⣿⣿⡇⠀⠈⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠘⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⣶⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣴⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠿⠿⣶⣶⣤⣤⣤⡴⠶⠞⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀

[ -- 𝓦𝓮𝓵𝓬𝓸𝓶𝓮 𝓫𝓪𝓬𝓴 𝓙𝓸𝓪𝓷 -- ]
          ]],
          -- Definimos los atajos (keys) aquí mismo
          keys = {
            { icon = " ", key = "f", desc = "Find Files", action = ":lua Snacks.dashboard.pick('files')" },
            { icon = " ", key = "r", desc = "Recent Files", action = ":lua Snacks.dashboard.pick('oldfiles')" },
            { icon = " ", key = "c", desc = "Config", action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})" },
            { icon = " ", key = "s", desc = "Restore Session", section = "session" },
            { icon = " ", key = "q", desc = "Quit", action = ":qa" },
          },
        },
        -- Definimos el orden de las secciones que se verán
        sections = {
          { section = "header" },
          { section = "keys", gap = 1, padding = 1 },
     
        },
      },
    },
    -- El init debe estar dentro de la tabla principal del plugin
    init = function()
      vim.api.nvim_create_autocmd("ColorScheme", {
        callback = function()
          vim.api.nvim_set_hl(0, "SnacksDashboardHeader", {
            fg = "#f38ba8",
            bold = true,
          })
        end,
      })
    end,
  },
}
